svhelper/aprinter/aprinter/hal/stm32/Stm32f2Sdio.h
/*
 * Copyright (c) 2015 Ambroz Bizjak
 * Copyright (c) 2018 BOBAH
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef APRINTER_STM32F2SDIO_H
#define APRINTER_STM32F2SDIO_H

#include <stdint.h>
#include <stddef.h>
#include <limits.h>

#include <aprinter/meta/MinMax.h>
#include <aprinter/meta/ServiceUtils.h>
#include <aprinter/base/Object.h>
#include <aprinter/base/DebugObject.h>
#include <aprinter/base/Assert.h>
#include <aprinter/base/Hints.h>
#include <aprinter/misc/ClockUtils.h>
#include <aprinter/hal/stm32/Stm32f2Pins.h>
#include <aprinter/hal/generic/SdioInterface.h>
#include <aprinter/system/InterruptLock.h>

namespace APrinter {

template <typename Arg>
class Stm32f2Sdio {
    using Context        = typename Arg::Context;
    using ParentObject   = typename Arg::ParentObject;
    using CommandHandler = typename Arg::CommandHandler;
    using BusyTimeout    = typename Arg::BusyTimeout;
    using Params         = typename Arg::Params;
    
public:
    struct Object;
    
private:
    static_assert(Params::SdClockPrescaler >= 0 && Params::SdClockPrescaler <= 255, "");
    
    using TheClockUtils = ClockUtils<Context>;
    using TheDebugObject = DebugObject<Context, Object>;
    using FastEvent = typename Context::EventLoop::template FastEventSpec<Stm32f2Sdio>;
    
    enum {INIT_STATE_OFF, INIT_STATE_POWERON, INIT_STATE_ON};
    enum {CMD_STATE_READY, CMD_STATE_BUSY, CMD_STATE_WAIT_BUSY};
    enum {DATA_STATE_READY, DATA_STATE_WAIT_COMPL, DATA_STATE_WAIT_RXTX, DATA_STATE_WAIT_DMA};
    
    static int const SdPinsAF = 12;
    using SdPinsMode = Stm32f2PinOutputMode<Stm32f2PinOutputTypeNormal, Stm32f2PinOutputSpeedHigh, Stm32f2PinPullModePullUp>;
    
    using SdPinCK = Stm32f2Pin<Stm32f2PortC, 12>;
    using SdPinCmd = Stm32f2Pin<Stm32f2PortD, 2>;
    using SdPinD0 = Stm32f2Pin<Stm32f2PortC, 8>;
    using SdPinD1 = Stm32f2Pin<Stm32f2PortC, 9>;
    using SdPinD2 = Stm32f2Pin<Stm32f2PortC, 10>;
    using SdPinD3 = Stm32f2Pin<Stm32f2PortC, 11>;
    
    static SDIO_TypeDef * sdio () { return SDIO; }
    
    static typename TheClockUtils::TimeType const DmaTimeoutTicks = 0.5 * TheClockUtils::time_freq;
    static typename TheClockUtils::TimeType const BusyTimeoutTicks = BusyTimeout::value() * TheClockUtils::time_freq;
    
public:
    static bool const IsWideMode = Params::IsWideMode;
    static size_t const BlockSize = 512;
    static size_t const MaxIoBlocks = -1;
    static int const MaxIoDescriptors = INT_MAX;
    
    static void init (Context c)
    {
        auto *o = Object::self(c);
        
        Context::Pins::template setAlternateFunction<SdPinCK,  SdPinsAF, SdPinsMode>(c);
        Context::Pins::template setAlternateFunction<SdPinCmd, SdPinsAF, SdPinsMode>(c);
        Context::Pins::template setAlternateFunction<SdPinD0,  SdPinsAF, SdPinsMode>(c);
        if (IsWideMode) {
            Context::Pins::template setAlternateFunction<SdPinD1,  SdPinsAF, SdPinsMode>(c);
            Context::Pins::template setAlternateFunction<SdPinD2,  SdPinsAF, SdPinsMode>(c);
            Context::Pins::template setAlternateFunction<SdPinD3,  SdPinsAF, SdPinsMode>(c);
        }
        
        Context::EventLoop::template initFastEvent<FastEvent>(c, Stm32f2Sdio::event_handler);
        
        NVIC_DisableIRQ(SDIO_IRQn);
        NVIC_SetPriority(SDIO_IRQn, INTERRUPT_PRIORITY-1);
        
        o->init_state = INIT_STATE_OFF;
        
        TheDebugObject::init(c);
    }
    
    static void deinit (Context c)
    {
        TheDebugObject::deinit(c);
        
        reset_internal(c);
    }
    
    static void reset (Context c)
    {
        TheDebugObject::access(c);
        
        reset_internal(c);
    }
    
    static void startPowerOn (Context c, SdioIface::InterfaceParams if_params)
    {
        auto *o = Object::self(c);
        TheDebugObject::access(c);
        AMBRO_ASSERT(o->init_state == INIT_STATE_OFF)
        
        msp_init(c);
        
        configure_interface(if_params);
        
        __SDIO_DISABLE();
        
        SDIO_PowerState_ON(sdio());
        
        o->init_state = INIT_STATE_POWERON;
    }
    
    static void completePowerOn (Context c)
    {
        auto *o = Object::self(c);
        TheDebugObject::access(c);
        AMBRO_ASSERT(o->init_state == INIT_STATE_POWERON)
        
        __SDIO_ENABLE();
        
        o->init_state = INIT_STATE_ON;
        o->pending = false;
        o->cmd_state = CMD_STATE_READY;
        o->data_state = DATA_STATE_READY;
    }
    
    static void reconfigureInterface (Context c, SdioIface::InterfaceParams if_params)
    {
        auto *o = Object::self(c);
        TheDebugObject::access(c);
        AMBRO_ASSERT(o->init_state == INIT_STATE_ON)
        AMBRO_ASSERT(!o->pending)
        AMBRO_ASSERT(o->cmd_state == CMD_STATE_READY)
        AMBRO_ASSERT(o->data_state == DATA_STATE_READY)
        
        configure_interface(if_params);
    }
    
    static void startCommand (Context c, SdioIface::CommandParams cmd_params)
    {
        auto *o = Object::self(c);
        TheDebugObject::access(c);
        AMBRO_ASSERT(o->init_state == INIT_STATE_ON)
        AMBRO_ASSERT(!o->pending)
        AMBRO_ASSERT(o->cmd_state == CMD_STATE_READY)
        AMBRO_ASSERT(o->data_state == DATA_STATE_READY)
        
        o->data_dir = cmd_params.direction;
        
