svhelper/aprinter/aprinter/hal/stm32/Stm32f2Sdio.h
        if (cmd_params.direction != SdioIface::DATA_DIR_NONE) {
            AMBRO_ASSERT(cmd_params.direction == SdioIface::DATA_DIR_READ || cmd_params.direction == SdioIface::DATA_DIR_WRITE)
            AMBRO_ASSERT(cmd_params.num_blocks >= 1)
            AMBRO_ASSERT(cmd_params.num_blocks <= MaxIoBlocks)
            AMBRO_ASSERT(CheckTransferVector(cmd_params.data_vector, cmd_params.num_blocks * (size_t)(BlockSize/4)))
            
            o->data_num_blocks = cmd_params.num_blocks;
            o->data_vector = cmd_params.data_vector;
            
            if (cmd_params.direction == SdioIface::DATA_DIR_READ) {
                start_data(c);
            }
        }
        
        sdio()->ICR = SDIO_FLAG_CMDSENT|SDIO_FLAG_CCRCFAIL|SDIO_FLAG_CTIMEOUT|SDIO_FLAG_CMDREND;
        
        uint32_t response_sdio;
        switch (cmd_params.response_type) {
            case SdioIface::RESPONSE_NONE:
                response_sdio = SDIO_RESPONSE_NO; break;
            case SdioIface::RESPONSE_SHORT:
            case SdioIface::RESPONSE_SHORT_BUSY:
                response_sdio = SDIO_RESPONSE_SHORT; break;
            case SdioIface::RESPONSE_LONG:
                response_sdio = SDIO_RESPONSE_LONG; break;
            default:
                AMBRO_ASSERT(0);
        }
        
        SDIO_CmdInitTypeDef cmd = SDIO_CmdInitTypeDef();
        cmd.Argument = cmd_params.argument;
        cmd.CmdIndex = cmd_params.cmd_index;
        cmd.Response = response_sdio;
        cmd.WaitForInterrupt = SDIO_WAIT_NO;
        cmd.CPSM = SDIO_CPSM_ENABLE;
        SDIO_SendCommand(sdio(), &cmd);
        
        o->cmd_state = CMD_STATE_BUSY;
        o->cmd_index = cmd_params.cmd_index;
        o->cmd_response_type = cmd_params.response_type;
        o->cmd_flags = cmd_params.flags;
        o->pending = true;
        o->results = SdioIface::CommandResults{SdioIface::CMD_ERROR_NONE};
        o->data_error = SdioIface::DATA_ERROR_NONE;
        
        Context::EventLoop::template triggerFastEvent<FastEvent>(c);
    }
    
    // This interrupt is called when we can transfer at least 8 words
    // from the FIFO (read) or into the FIFO (write). It must be fast!
    AMBRO_ALWAYS_INLINE
    static void sdio_irq (InterruptContext<Context> c)
    {
        auto *o = Object::self(c);
        //AMBRO_ASSERT(o->data_dir == SdioIface::DATA_DIR_READ || o->data_dir == SdioIface::DATA_DIR_WRITE)
        //AMBRO_ASSERT(o->descriptor_index < o->data_vector.num_descriptors)
        //AMBRO_ASSERT(o->buffer_ptr[0] != o->buffer_ptr[1])
        
        // Fetch the current buffer pointers.
        uint32_t *buffer_ptr0 = o->buffer_ptr[0];
        uint32_t *buffer_ptr1 = o->buffer_ptr[1];
        
        // Compute the difference between the addresses.
        // The sign of this determined whether we are reading or writing.
        uint32_t buffer_diff = (char *)buffer_ptr1 - (char *)buffer_ptr0;
        
        // Note that while we will be doing the transfers, we could get a positive
        // edges of the RXFIFOHF/TXFIFOHE flag, but anyway end up up with the
        // flag cleared. Due to the edge the NVIC would immediately reschedule
        // the interrupt, and we could then run without sufficient data/space in
        // the FIFO. So we will use NVIC_ClearPendingIRQ before allowing another
        // interrupt to fire.
        
        if (buffer_diff < UINT32_C(0x80000000)) {
            // We are reading - buffer_diff is the number of bytes left.
            
            // Read words.
            if (AMBRO_LIKELY(buffer_diff >= 32)) {
                uint32_t fifo_out;
                asm(
                    "ldmia %[fifo]!, {r4, r5, r6, r7}\n"
                    "stmia %[buffer_ptr0]!, {r4, r5, r6, r7}\n"
                    "ldmia %[fifo]!, {r4, r5, r6, r7}\n"
                    "stmia %[buffer_ptr0]!, {r4, r5, r6, r7}\n"
                    : [buffer_ptr0] "=&r" (buffer_ptr0),
                      [fifo] "=&r" (fifo_out)
                    : "[buffer_ptr0]" (buffer_ptr0),
                      "[fifo]" (&sdio()->FIFO)
                    : "r4", "r5", "r6", "r7", "memory"
                );
            } else {
                int rem_words = buffer_diff / 4;
                int i = 0;
                do {
                    buffer_ptr0[i++] = sdio()->FIFO;
                } while (i < rem_words);
                buffer_ptr0 = buffer_ptr1;
            }
            
            // More bytes in buffer?
            if (AMBRO_LIKELY(buffer_ptr0 < buffer_ptr1)) {
                o->buffer_ptr[0] = buffer_ptr0;
                NVIC_ClearPendingIRQ(SDIO_IRQn);
                return;
            }
        } else {
            // We are writing - negate buffer_diff to get the number of bytes left.
            buffer_diff = -buffer_diff;
            
            // Write words.
            if (AMBRO_LIKELY(buffer_diff >= 32)) {
                uint32_t fifo_out;
                asm(
                    "ldmia %[buffer_ptr1]!, {r4, r5, r6, r7}\n"
                    "stmia %[fifo]!, {r4, r5, r6, r7}\n"
                    "ldmia %[buffer_ptr1]!, {r4, r5, r6, r7}\n"
                    "stmia %[fifo]!, {r4, r5, r6, r7}\n"
                    : [buffer_ptr1] "=&r" (buffer_ptr1),
                    [fifo] "=&r" (fifo_out)
                    : "[buffer_ptr1]" (buffer_ptr1),
                    "[fifo]" (&sdio()->FIFO)
                    : "r4", "r5", "r6", "r7", "memory"
                );
            } else {
                int rem_words = buffer_diff / 4;
                int i = 0;
                do {
                    sdio()->FIFO = buffer_ptr1[i++];
                } while (i < rem_words);
                buffer_ptr1 = buffer_ptr0;
            }
            
            // More bytes in buffer?
            if (AMBRO_LIKELY(buffer_ptr1 < buffer_ptr0)) {
                o->buffer_ptr[1] = buffer_ptr1;
                NVIC_ClearPendingIRQ(SDIO_IRQn);
                return;
            }
        }
        
        // Moving to the next buffer.
        int descriptor_index = o->descriptor_index + 1;
        o->descriptor_index = descriptor_index;
        
        // If this was the last buffer, disable the IRQ, and stop.
        if (AMBRO_UNLIKELY(descriptor_index >= o->data_vector.num_descriptors)) {
            NVIC_DisableIRQ(SDIO_IRQn);
            return;
        }
        
        // Load the new buffer pointers.
        auto desc = o->data_vector.descriptors[descriptor_index];
        bool buffer_order = (o->data_dir == SdioIface::DATA_DIR_READ);
        o->buffer_ptr[!buffer_order] = desc.buffer_ptr;
        o->buffer_ptr[ buffer_order] = desc.buffer_ptr + desc.num_words;
        
        NVIC_ClearPendingIRQ(SDIO_IRQn);
    }
    
    using EventLoopFastEvents = MakeTypeList<FastEvent>;
    
