svhelper/aprinter/aprinter/hal/stm32/Stm32f2Sdio.h
private:
    static void msp_init (Context c)
    {
        __HAL_RCC_SDIO_CLK_ENABLE();
    }
    
    static void msp_deinit (Context c)
    {
        __HAL_RCC_SDIO_CLK_DISABLE();
    }
    
    static void configure_interface (SdioIface::InterfaceParams if_params)
    {
        SD_InitTypeDef tmpinit = SD_InitTypeDef();
        tmpinit.ClockEdge           = SDIO_CLOCK_EDGE_RISING;
        tmpinit.ClockBypass         = SDIO_CLOCK_BYPASS_DISABLE;
        tmpinit.ClockPowerSave      = SDIO_CLOCK_POWER_SAVE_DISABLE;
        tmpinit.BusWide             = if_params.wide_data_bus ? SDIO_BUS_WIDE_4B : SDIO_BUS_WIDE_1B;
        tmpinit.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
        tmpinit.ClockDiv            = if_params.clock_full_speed ? Params::SdClockPrescaler : SDIO_INIT_CLK_DIV;
        SDIO_Init(sdio(), tmpinit);
    }
    
    static void start_data (Context c)
    {
        auto *o = Object::self(c);
        AMBRO_ASSERT(o->data_state == DATA_STATE_READY)
        AMBRO_ASSERT(o->data_dir == SdioIface::DATA_DIR_READ || o->data_dir == SdioIface::DATA_DIR_WRITE)
        AMBRO_ASSERT(o->data_vector.num_descriptors > 0)
        
        sdio()->ICR = SDIO_FLAG_DCRCFAIL|SDIO_FLAG_DTIMEOUT|SDIO_FLAG_RXOVERR|SDIO_FLAG_TXUNDERR|SDIO_FLAG_STBITERR|SDIO_FLAG_DATAEND;
        
        o->data_state = DATA_STATE_WAIT_COMPL;
        o->descriptor_index = 0;
        
        auto desc = o->data_vector.descriptors[0];
        bool buffer_order = (o->data_dir == SdioIface::DATA_DIR_READ);
        o->buffer_ptr[!buffer_order] = desc.buffer_ptr;
        o->buffer_ptr[ buffer_order] = desc.buffer_ptr + desc.num_words;
        
        memory_barrier();
        
        if (o->data_dir == SdioIface::DATA_DIR_READ) {
            sdio()->MASK = SDIO_MASK_RXFIFOHFIE;
        } else {
            sdio()->MASK = SDIO_MASK_TXFIFOHEIE;
        }
        
        NVIC_ClearPendingIRQ(SDIO_IRQn);
        NVIC_EnableIRQ(SDIO_IRQn);
        
        SDIO_DataInitTypeDef data_init = SDIO_DataInitTypeDef();
        data_init.DataTimeOut   = Params::DataTimeoutBusClocks;
        data_init.DataLength    = (uint32_t)o->data_num_blocks * BlockSize;
        data_init.DataBlockSize = SDIO_DATABLOCK_SIZE_512B;
        data_init.TransferDir   = o->data_dir == SdioIface::DATA_DIR_READ ? SDIO_TRANSFER_DIR_TO_SDIO : SDIO_TRANSFER_DIR_TO_CARD;
        data_init.TransferMode  = SDIO_TRANSFER_MODE_BLOCK;
        data_init.DPSM          = SDIO_DPSM_ENABLE;
        SDIO_ConfigData(sdio(), &data_init);
    }
    
    static void reset_internal (Context c)
    {
        auto *o = Object::self(c);
        
        if (o->init_state == INIT_STATE_ON) {
            if (o->cmd_state != CMD_STATE_READY) {
                sdio()->CMD = 0;
            }
            
            if (o->data_state != DATA_STATE_READY) {
                NVIC_DisableIRQ(SDIO_IRQn);
                sdio()->DCTRL = 0;
            }
        }
        
        if (o->init_state >= INIT_STATE_POWERON) {
            SDIO_PowerState_OFF(sdio());
            msp_deinit(c);
        }
        
        o->init_state = INIT_STATE_OFF;
        
        Context::EventLoop::template resetFastEvent<FastEvent>(c);
    }
    
    static void event_handler (Context c)
    {
        auto *o = Object::self(c);
        TheDebugObject::access(c);
        AMBRO_ASSERT(o->init_state == INIT_STATE_ON)
        AMBRO_ASSERT(o->pending)
        AMBRO_ASSERT(o->cmd_state != CMD_STATE_READY || o->data_state != DATA_STATE_READY)
        
        work_cmd(c);
        work_data(c);
        
        if (o->cmd_state != CMD_STATE_READY || o->data_state != DATA_STATE_READY) {
            Context::EventLoop::template triggerFastEvent<FastEvent>(c);
            return;
        }
        
        o->pending = false;
        
        return CommandHandler::call(c, o->results, o->data_error);
    }
    
    static void work_cmd (Context c)
    {
        auto *o = Object::self(c);
        AMBRO_ASSERT(o->cmd_state == CMD_STATE_READY || o->cmd_state == CMD_STATE_BUSY || o->cmd_state == CMD_STATE_WAIT_BUSY)
        
        if (o->cmd_state == CMD_STATE_READY) {
            return;
        }
        
        uint32_t status = sdio()->STA;
        
        if (o->cmd_state == CMD_STATE_BUSY) {
            if (o->cmd_response_type == SdioIface::RESPONSE_NONE) {
                if (!(status & SDIO_FLAG_CMDSENT)) {
                    return;
                }
            } else {
                if (!(o->cmd_flags & SdioIface::CMD_FLAG_NO_CRC_CHECK)) {
                    if ((status & SDIO_FLAG_CCRCFAIL)) {
                        o->results.error_code = SdioIface::CMD_ERROR_RESPONSE_CHECKSUM;
                        goto cmd_done;
                    }
                }
                
                if ((status & SDIO_FLAG_CTIMEOUT)) {
                    o->results.error_code = SdioIface::CMD_ERROR_RESPONSE_TIMEOUT;
                    goto cmd_done;
                }
                
                if (!(status & SDIO_FLAG_CMDREND) && !(status & SDIO_FLAG_CCRCFAIL)) {
                    return;
                }
                
                if (!(o->cmd_flags & SdioIface::CMD_FLAG_NO_CMDNUM_CHECK)) {
                    if (SDIO_GetCommandResponse(sdio()) != o->cmd_index) {
                        o->results.error_code = SdioIface::CMD_ERROR_BAD_RESPONSE_CMD;
                        goto cmd_done;
                    }
                }
                
                o->results.response[0] = sdio()->RESP1;
                
                if (o->cmd_response_type == SdioIface::RESPONSE_LONG) {
                    o->results.response[1] = sdio()->RESP2;
                    o->results.response[2] = sdio()->RESP3;
                    o->results.response[3] = sdio()->RESP4;
                }
                
                if (o->cmd_response_type == SdioIface::RESPONSE_SHORT_BUSY) {
                    o->cmd_state = CMD_STATE_WAIT_BUSY;
                    o->busy_poll_timer.setAfter(c, BusyTimeoutTicks);
                }
            }
        }
        
        if (o->cmd_state == CMD_STATE_WAIT_BUSY) {
            // The SDIO peripheral does not indicate the busy status but
            // looking at the D0 pin level seems to work.
            if (!(Context::Pins::template get<SdPinD0>(c))) {
                if (!(o->busy_poll_timer.isExpired(c))) {
                    return;
                }
                o->results.error_code = SdioIface::CMD_ERROR_BUSY_TIMEOUT;
            }
        }
        
    cmd_done:
        o->cmd_state = CMD_STATE_READY;
        
        if (o->data_dir == SdioIface::DATA_DIR_WRITE) {
            start_data(c);
        }
    }
    
    static void work_data (Context c)
    {
        auto *o = Object::self(c);
        
        if (o->data_state == DATA_STATE_READY) {
            return;
        }
        
        uint32_t status = sdio()->STA;
        
        while (true) {
            switch (o->data_state) {
                case DATA_STATE_WAIT_COMPL: {
                    if ((status & SDIO_FLAG_DCRCFAIL)) {
                        o->data_error = SdioIface::DATA_ERROR_CHECKSUM;
                    }
                    else if ((status & SDIO_FLAG_DTIMEOUT)) {
                        o->data_error = SdioIface::DATA_ERROR_TIMEOUT;
                    }
                    else if ((status & SDIO_FLAG_RXOVERR)) {
                        o->data_error = SdioIface::DATA_ERROR_RX_OVERRUN;
                    }
                    else if ((status & SDIO_FLAG_TXUNDERR)) {
                        o->data_error = SdioIface::DATA_ERROR_TX_OVERRUN;
                    }
                    else if ((status & SDIO_FLAG_STBITERR)) {
                        o->data_error = SdioIface::DATA_ERROR_STBITER;
                    }
                    else if (!(status & SDIO_FLAG_DATAEND)) {
                        return;
                    }
                    
                    o->data_state = DATA_STATE_WAIT_RXTX;
                } break;
                
