svhelper/aprinter/aprinter/hal/stm32/Stm32f2Sdio.h
                case DATA_STATE_WAIT_RXTX: {
                    if ((status & SDIO_FLAG_RXACT) || (status & SDIO_FLAG_TXACT)) {
                        return;
                    }
                    
                    // When reading, we need to make sure the last words in the FIFO get flushed to memory,
                    // in case less than 8 words remain which would not trigger the RXFIFOHF flag.
                    // There is no such issue for writing, because as SDIO transmits, there will eventually
                    // be at least 8 words free in the FIFO, triggering the interrupt.
                    if (o->data_dir == SdioIface::DATA_DIR_READ) {
                        sdio()->MASK = SDIO_MASK_RXDAVLIE;
                    }
                    
                    o->data_state = DATA_STATE_WAIT_DMA;
                    o->poll_timer.setAfter(c, DmaTimeoutTicks);
                } break;
                
                case DATA_STATE_WAIT_DMA: {
                    if (o->data_error == SdioIface::DATA_ERROR_NONE) {
                        // Need to wait for the transfer to complete.
                        int descriptor_index;
                        AMBRO_LOCK_T(InterruptTempLock(), c, lock_c) {
                            descriptor_index = o->descriptor_index;
                        }
                        if (descriptor_index < o->data_vector.num_descriptors) {
                            if (!o->poll_timer.isExpired(c)) {
                                return;
                            }
                            o->data_error = SdioIface::DATA_ERROR_DMA;
                        }
                    }
                    
                    NVIC_DisableIRQ(SDIO_IRQn);
                    sdio()->DCTRL = 0;
                    
                    memory_barrier();
                    
                    o->data_state = DATA_STATE_READY;
                    return;
                } break;
                
                default:
                    AMBRO_ASSERT(false);
            }
        }
    }
    
public:
    struct Object : public ObjBase<Stm32f2Sdio, ParentObject, MakeTypeList<
        TheDebugObject
    >> {
        uint8_t init_state;
        bool pending;
        uint8_t cmd_state;
        uint8_t data_state;
        uint8_t cmd_index;
        uint8_t cmd_response_type;
        uint8_t cmd_flags;
        uint8_t data_dir;
        size_t data_num_blocks;
        TransferVector<uint32_t> data_vector;
        int descriptor_index;
        uint32_t *buffer_ptr[2];
        SdioIface::CommandResults results;
        SdioIface::DataErrorCode data_error;
        typename TheClockUtils::PollTimer poll_timer;
        typename TheClockUtils::PollTimer busy_poll_timer;
    };
};

#define APRINTER_STM32F2_SDIO_GLOBAL(sdio, context) \
extern "C" \
__attribute__((used)) \
void SDIO_IRQHandler (void) \
{ \
    sdio::sdio_irq(MakeInterruptContext((context))); \
}

template <
    bool TIsWideMode,
    uint32_t TDataTimeoutBusClocks,
    int TSdClockPrescaler
>
struct Stm32f2SdioService {
    static bool const IsWideMode = TIsWideMode;
    static uint32_t const DataTimeoutBusClocks = TDataTimeoutBusClocks;
    static int const SdClockPrescaler = TSdClockPrescaler;
    
    APRINTER_ALIAS_STRUCT_EXT(Sdio, (
        APRINTER_AS_TYPE(Context),
        APRINTER_AS_TYPE(ParentObject),
        APRINTER_AS_TYPE(CommandHandler),
        APRINTER_AS_TYPE(BusyTimeout)
    ), (
        using Params = Stm32f2SdioService;
        APRINTER_DEF_INSTANCE(Sdio, Stm32f2Sdio)
    ))
};

}

#endif
